{"448510":{"success":true,"data":{"type":"game","name":"Overcooked","steam_appid":448510,"required_age":0,"is_free":false,"controller_support":"full","dlc":[530060],"detailed_description":"<h1>INTRODUCING: EPIC CHEF</h1><p><a href=\"https://store.steampowered.com/app/1312960/Epic_Chef/\" target=\"_blank\" rel=\"noreferrer\"  id=\"dynamiclink_0\" >https://store.steampowered.com/app/1312960/Epic_Chef/</a><br><br>Epic Chef is a story-driven adventure game flavoured with life-sim farming, and crafting elements, blended together into one delicious dish via an interactive cooking experience - all served with a side of humour and elaborate cast of characters.<br><br><a href=\"https://store.steampowered.com/app/1312960/Epic_Chef/\" target=\"_blank\" rel=\"noreferrer\"  >https://store.steampowered.com/app/1312960/Epic_Chef/</a>","about_the_game":"<img src=\"https://cdn.cloudflare.steamstatic.com/steam/apps/448510/extras/cat-burger.jpg?t=1643291180\" /><br><br>Overcooked is a chaotic couch co-op cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook and serve up a variety of tasty orders before the baying customers storm out in a huff. Sharpen your knives and dust off your chef’s whites, there isn’t mushroom for error and the steaks are high in these crazy kitchens! <br><br>The Onion Kingdom is in danger and only the finest cooking can save it! In Overcooked players must journey through a variety of cruel and unusual kitchens on their quest to become master chefs capable of conquering an ancient edible evil which plagues the land.<br><br>Play solo or engage in classic, chaotic couch co-op for up to four players in both co-operative and competitive challenge modes. You’ll have to cook a range of different dishes and work together in order to become the most effective and ultimate team! <br><br><strong><u>A CULINARY QUEST</u></strong><br><br>The Onion Kingdom is a rich world full of cruel and unusual kitchens for you to conquer. Take part in an epic journey and tackle an increasingly challenging and bizarre gauntlet of kitchens which will push your skills of co-operation and co-ordination to the very limits. Each level brings a new challenge for you and your team to overcome, whether it's sliding around on a pirate ship, moving between speeding trucks, cooking on an ice floe or serving food in the bowels of a fiery underworld, each level will test the mettle of even the bravest chefs. <br><br><strong><u>SIMPLE CONTROLS/DEEP CHALLENGE </u></strong><br><br>Overcooked is so easy to pick up that anyone can join in the fun, but finding a team who can communicate and co-ordinate their actions when the pizza hits the fan, that's when only a well-oiled team of super-chefs will come out on top! <br><br><strong><u>DIFFERENT WAYS TO PLAY</u></strong><br><br>Whether indulging in deep fried local co-op or sautéed single player, as you play through the game you'll unlock new levels, new chef characters and even competitive challenge levels which allow teams of two to engage in hard boiled head-to-head in the kitchen. <br><br>However you want to play, if you think you can stand the heat, then get ready to enter the kitchen! ","short_description":"Overcooked is a chaotic couch co-op cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook and serve up a variety of tasty orders before the baying customers storm out in a huff.","supported_languages":"English, French, Italian, German, Spanish - Spain, Simplified Chinese, Japanese","header_image":"https://cdn.akamai.steamstatic.com/steam/apps/448510/header.jpg?t=1643291180","website":"http://www.ghosttowngames.com/overcooked","pc_requirements":{"minimum":"<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li><strong>OS:</strong> Windows 7 (32-bit)<br></li><li><strong>Processor:</strong> Dual Core 2.4Ghz<br></li><li><strong>Memory:</strong> 2 GB RAM<br></li><li><strong>Graphics:</strong> GeForce 8800 GT / AMD HD 6850 / Intel HD Graphics 4400 or above<br></li><li><strong>DirectX:</strong> Version 11<br></li><li><strong>Storage:</strong> 750 MB available space<br></li><li><strong>Sound Card:</strong> DirectX Compatible Sound Card<br></li><li><strong>Additional Notes:</strong> Gamepads Recommended</li></ul>"},"mac_requirements":[],"linux_requirements":[],"legal_notice":"Overcooked, its logo and all related logos and slogans are copyright Ghost Town Games Ltd. <br />\r\nAll logos are copyright of their respective owners. ALL RIGHTS RESERVED. Overcooked. Developed by Ghost Town Games Ltd. © 2015. Overcooked and Ghost Town Games are trademarks or registered trademarks of Ghost Town Games Ltd. Overcooked published by Team17. © 2015. Team17 is a registered trademark of Team17 Digital Limited. All other trademarks, copyrights and logos are property of their respective owners.","developers":["Ghost Town Games Ltd."],"price_overview":{"currency":"CAD","initial":1899,"final":379,"discount_percent":80,"initial_formatted":"CDN$ 18.99","final_formatted":"CDN$ 3.79"},"metacritic":{"score":81,"url":"http://www.metacritic.com/game/pc/overcooked?ftag=MCD-06-10aaa1f"},"categories":[{"id":2,"description":"Single-player"},{"id":1,"description":"Multi-player"},{"id":49,"description":"PvP"},{"id":37,"description":"Shared/Split Screen PvP"},{"id":9,"description":"Co-op"},{"id":39,"description":"Shared/Split Screen Co-op"},{"id":24,"description":"Shared/Split Screen"},{"id":22,"description":"Steam Achievements"},{"id":28,"description":"Full controller support"},{"id":29,"description":"Steam Trading Cards"},{"id":23,"description":"Steam Cloud"},{"id":41,"description":"Remote Play on Phone"},{"id":42,"description":"Remote Play on Tablet"},{"id":43,"description":"Remote Play on TV"},{"id":44,"description":"Remote Play Together"}],"genres":[{"id":"1","description":"Action"},{"id":"4","description":"Casual"},{"id":"23","description":"Indie"},{"id":"28","description":"Simulation"}]}}}